SFU_Link/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      flash[:success] = "Welcome to SFU Link #{@user.firstname}"
---
INSERT INTO "users" ("firstname", "lastname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 11]]